<?php

return [
    'footer_app' => 'Copyright © 2005-2016, Молодёжное научное общество "Q-BIT" <br>
                тех. поддержка: Н.А. Арзубов <br>
                При использовании материалов сайта ссылка на dots.org.ua обязательна.', //@todo
    'footer_main' => 'Copyright © 2005-2016, Молодёжное научное общество "Q-BIT" <br>
            тех. поддержка: Н.А. Арзубов <br>
            При использовании материалов сайта ссылка на dots.org.ua обязательна.',
    'footer_2' => '
            Copyright © 2005-:date, Молодёжное научное общество "Q-BIT" <br>
            тех. поддержка: Н.А. Арзубов <br>
            При использовании материалов сайта ссылка на dots.org.ua обязательна.',
    'description_main_1' => 'С 16 февраля 2016 тестирующая система DOTS доступна для преподавателей информатики Харькова
                        и Харьковской области. Теперь все, кто преподаёт программирование, сможет зарегистрировать в
                        системе своих учеников, объединять их в группы и проводить практикумы по программированию с
                        использованием тестирующей системы.',
    'description_main_2' => '          <b>Dots</b> - это тестирующая система для dots.org.ua, написаная на Python, sh и C и
                            интенсивно
                            использующая все возможности Docker контейнеров и Cgroup подсистемы ядра, запуская
                            компиляторы и
                            тестируя пользовательские решения в отдельных Docker контейнерах. Такой подход делает DDots
                            максимально гибкой и модульной системой. <br> <br>

                            Один DDots обрабатывает одно решение в единицу времени и предзагружает два решения в очередь
                            для
                            уменьшения задержек, связанных с сетью. Таким образом, для нагрузки нескольких ядер
                            рекомендуется запускать N контейнеров DDots (это делается автоматически, Makefile
                            автоматически
                            определяет количество доступных ядер и использует все возможности). <br><br>',
    'description_2' => 'Практикум по програмированию',
    'email_nickname' => 'Email / nickname',
    'password' => 'Пароль',
    'remember_me' => 'Запомнить меня',
    'forgot_password' => 'Забыли пароль?',
    'latest_news' => 'Последние новости',
    'supported_by' => 'Проект был поддержан',
    'all_sponsors' => 'Все спонсоры',
    'sub_teachers_mentors' => 'Преподаватели и менторы',
    'all_teachers_mentors' => 'Все преподаватели и менторы',
    'all_subdomains' => 'Все поддомены',
    'upgrade' => 'Улучшить',
    'update' => 'Обновить',
    'years_old' => 'Лет',
    'with_us' => 'с нами',
    'profession' => 'Профессия',
    'place_of_study' => 'Место учёбы',
    'primary_language' => 'Основной язык',
    'full_name' => 'Имя',
    'nickname' => 'Nickname',
    'birthday' => 'День рождения',
    'programming_language' => 'Язык программирования',
    'not_selected' => 'не выбран',
    'vk' => 'VK',
    'vk_link' => 'Ссылка на профиль VK',
    'fb' => 'Facebook',
    'fb_link' => 'Ссылка на профиль Facebook',
    'email' => 'Email',
    'email_verification' => 'Вам будет отправлено письмо с подтверждением.',
    'avatar' => 'Аватар',
    'description' => 'Описание',
    'my_teachers' => 'Мои преподаватели',
    'my_teacher' => 'МоЙ преподаватель',
    'all_teachers' => 'Все преподаватели',
    'request_is_sent' => 'запрос отправлен',
    'actions' => 'Действия',
    'volumes' => 'Тома',
    'date' => 'Дата',
    'dots_root' => 'DOTS ROOT',
    'dots_caps' => 'DOTS',
    'reset' => 'Сбросить',
    'name' => 'Имя',
    'cancel' => 'Отменить',
    'save' => 'Сохранить',
    'id' => 'ID',
    'created_date' => 'Дата создания',
    'updated_date' => 'Дата редактирования',
    'deleted_date' => 'Дата удаления',
    'add_group' => 'Добавить группу',
    'edit' => 'Редактировать',
    'delete' => 'Удалить',
    'restore' => 'Восстановить',
    'error_page' => 'Возвращайтесь сразу же',
    'cancel_warn' => 'Вы уверенны что хотите покинуть эту страницу? Изменения не будут сохранены.',
    'confirm_password' => 'Поддтвердить пароль'
];